#!/bin/bash

# 打印数组的key
########################################################################################
arr1=(1 2 3 4 5 6)
for i in ${!arr1[@]}
do
    echo "$i"
done

for j in ${!arr1[*]}
do
    echo "$j"
done
# 以上两种都可以打印出对应的key
########################################################################################
# 声明其为数组
declare -A arr
arr=([key1]=ses1 [key2]=ses2 [sex]=man [addr]=beijing)

for k in ${arr[@]}
do
    echo "$k"
done

for m in ${arr[*]}
do
    echo "$m"
done

# 上面就可以输出数组中的key, key1 key2  sex addr
########################################################################################
